# Manipulating DataFrames
1. Run the cell below to setup this lab.

In [4]:
import pandas as pd
data = {'first': ['Carl', 'Francis', 'Sam'],
        'last':  ['Po',   'Nyguen',  'Smith'],
        'age':   ['32',   '45',      '22']}
clients = pd.DataFrame(data)
clients

     first    last age
0     Carl      Po  32
1  Francis  Nyguen  45
2      Sam   Smith  22

2. Rename the columns from 'first' to 'First', 'last' to 'Last', and 'age' to 'Age'. Provide the 'columns' argument with a dictionary mapping current column names to the new names.

In [5]:
clients.rename(columns={'first':'First', 'last': 'Last', 'age' : 'Age'}, inplace=True)
clients

     First    Last Age
0     Carl      Po  32
1  Francis  Nyguen  45
2      Sam   Smith  22

3. Create a new column 'Name' by combining the values from the columns 'First' and 'Last'. You can use addtion between the columns: `clients.First + ' ' + clients.Last` to create the values.

In [7]:
clients['Name'] = clients.First + ' ' + clients.Last
clients

     First    Last Age            Name
0     Carl      Po  32         Carl Po
1  Francis  Nyguen  45  Francis Nyguen
2      Sam   Smith  22       Sam Smith

4. Drop the columns 'First' and 'Last' using the `.drop()` method. The columns parameter takes a list of column names to drop.

In [8]:
clients.drop(columns=['First', 'Last'], inplace=True)
clients

  Age            Name
0  32         Carl Po
1  45  Francis Nyguen
2  22       Sam Smith